print('Задача 5. Текстовый редактор')

# Мы продолжаем разрабатывать новый текстовый редактор,
# и в этот раз нам поручили написать для него код,
# который считает количество любой буквы
# и любой цифры в тексте (а не только буквы Ы как раньше).
#
# Напишите функцию count_letters,
# которая принимает на вход текст и подсчитывает,
# какое в нём количество цифр K и букв N.
#
# Функция должна вывести на экран информацию
# о найденных буквах и цифрах в определенном формате.
#
# Пример:
# Введите текст: 100 лет в обед
# Какую цифру ищем? 0
# Какую букву ищём? л
#
# Количество цифр 0: 2
# Количество букв л: 1


def count_letters():
  text = input("Введите текст: ")
  figure = input("Какую цифру ищем? ")
  letter = input("Какую букву ищем? ")
  count_figure = 0
  count_letter = 0
  for symbol in text:
    if symbol == figure:
      count_figure += 1
    if symbol == letter:
      count_letter += 1
  print("\nКоличество цифр", figure + ":", count_figure, "\nКоличество букв",
        letter + ":", count_letter)


count_letters()
